class WorkoutDiagnosisService
  DIAGNOSIS_MAP = {
    ["長時間（30分程度）","重い","胸"]   => ["ベンチプレス"],
    ["長時間（30分程度）","重い","背中"] => ["デッドリフト"],
    ["長時間（30分程度）","重い","腕"]   => ["バーベルカール","ナロープレス"],
    ["長時間（30分程度）","重い","肩"]   => ["ミリタリープレス"],
    ["長時間（30分程度）","重い","足"]   => ["バーベルスクワット"],

    ["長時間（30分程度）","軽い","胸"]   => ["プッシュアップ"],
    ["長時間（30分程度）","軽い","背中"] => ["ワンハンドダンベルロー", "懸垂"],
    ["長時間（30分程度）","軽い","腕"]   => ["ワンハンドダンベルカール","フレンチプレス"],
    ["長時間（30分程度）","軽い","肩"]   => ["ダンベルサイドレイズ"],
    ["長時間（30分程度）","軽い","足"]   => ["ブルガリアンスクワット"],

    ["短時間（10分程度）","重い","胸"]   => ["ダンベルプレス"],
    ["短時間（10分程度）","重い","背中"] => ["ラットプルダウン"],
    ["短時間（10分程度）","重い","腕"]   => ["ケーブルカール","ケーブルプレスダウン"],
    ["短時間（10分程度）","重い","肩"]   => ["ショルダープレス"],
    ["短時間（10分程度）","重い","足"]   => ["レッグエクステンション"],

    ["短時間（10分程度）","軽い","胸"]   => ["ダンベルフライ"],
    ["短時間（10分程度）","軽い","背中"] => ["補助付き懸垂"],
    ["短時間（10分程度）","軽い","腕"]   => ["インクラインダンベルカール","キックバック"],
    ["短時間（10分程度）","軽い","肩"]   => ["フロントレイズ","リアレイズ"],
    ["短時間（10分程度）","軽い","足"]   => ["スクワット","ワイドスクワット"]
  }

  def self.judge(time, load, part)
    DIAGNOSIS_MAP[[time, load, part]] || []
  end
end